#! /usr/bin/env bash

#Рекурсивная функция обхода все txt файлов
function recur {
	for file in ./*
        do
		if [[ "$file" == *.txt ]]
		then
			enconv -x "$1" "$file"
		fi
        done
}
#Функция вывода справки
function usage {
	echo Использование: ./labra21.sh [КЛЮЧ]... КОДИРОВКА
        echo "  Производит рекурсивный обход текущего каталога и перекодировку всех текстовых файлов в нём на выбранную."
   	echo "  Аргументы, обязательные для длинных ключей, обязательны и для коротких."
      	echo "  Список ключей"
       	echo "    -h, --help показывает справку"
       	echo "    -l, --list список всех возможных кодировок"
       	echo "  Коды завершения:"
        echo "    0 всё отлично,"
	echo "    1 небольшая проблема (например излешние аргуметы в строке),"
       	echo "    2 серьёзная проблема (например, недоступен каталог или аргумент командной строки)"
       	echo "  Об ошибках в работе скрипта сообщайте по адресу <denstrygin@gmail.com>"
        echo "  Полная документация: отсутствует"
}
#проверка на кол-во аргументов
if [ $# -lt 1 ]
then
	echo "2: Недостаточно аргументов" >&2
elif [ $# -gt 3 ]
then
	echo "1: Излишнее количество аргументов" >&2
fi

#Проверка на правильность поступающих аргументов и вызов функций
if [ $# -eq 2 ]
then
	cod="$2"
	if [ "$1" = "-h" ] || [ "$1" = "--help" ]
	then
		usage
		recur "$cod"
	elif [ "$1" = "-l" ] || [ "$1" = "--list" ]
	then
		iconv --list
		recur "$cod"
	elif [ "$1" = "-hl" ] || [ "$1" = "-lh" ]
	then
       	        usage
		iconv --list
		recur "$cod"
	else
		echo "2: Недоступен аргумент комнадной стрроки" >&2
	fi
elif [ $# -eq 1 ]
then
	if [ "$1" = "--help" ]
	then
		usage
	else
		cod="$1"
		recur "$cod"
	fi
elif [ $# -eq 3 ]
then
	cod="$3"
	if [ "$1" = "-h" ] || [ "$1" = "--help" ]
	then
		if [ "$2" = "-l" ] || [ "$2" = "--list" ]
		then
                	usage
			iconv --list
			recur "$cod"
		else
			echo "2: Недоступен аргумент комнадной стрроки" >&2
		fi
	elif [ "$1" = "-l" ] || [ "$1" = "--list" ]
	then
		if [ "$2" = "-h" ] || [ "$2" = "--help" ]
		then
			iconv --list
			usage
			recur "$cod"
		else
			echo "2: Недоступен аргумент комнадной стрроки" >&2
		fi
	else
		echo "2: Недоступен аргумент комнадной стрроки" >&2
	fi
fi

